/*------------------------------------------------------------------------*/
/* FatFs ����ϵͳ��������ʾ������                                         */
/* (C)ChaN, 2018                                                          */
/*------------------------------------------------------------------------*/


#include "ff.h"


#if FF_USE_LFN == 3 /* ��̬�ڴ���� */

/*------------------------------------------------------------------------*/
/* �����ڴ��                                                             */
/*------------------------------------------------------------------------*/

/**
 * @brief �����ڴ��
 * @param msize Ҫ������ֽ���
 * @return ָ�������ڴ���ָ�루����ڴ治���򷵻�null��
 */
void *ff_memalloc(           /* ����ָ�������ڴ���ָ�루����ڴ治���򷵻ؿ�ָ�룩 */
                  UINT msize /* Ҫ������ֽ��� */
)
{
    return malloc(msize); /* ʹ��POSIX API�����µ��ڴ�� */
}

/*------------------------------------------------------------------------*/
/* �ͷ��ڴ��                                                             */
/*------------------------------------------------------------------------*/

/**
 * @brief �ͷ��ڴ��
 * @param mblock ָ��Ҫ�ͷŵ��ڴ���ָ�루���Ϊ����ִ���κβ�����
 */
void ff_memfree(
    void *mblock /* ָ��Ҫ�ͷŵ��ڴ���ָ�루���Ϊ����ִ���κβ����� */
)
{
    free(mblock); /* ʹ��POSIX API�ͷ��ڴ�� */
}

#endif


#if FF_FS_REENTRANT /* ������ʣ��̰߳�ȫ�� */

/*------------------------------------------------------------------------*/
/* ����ͬ������                                                           */
/*------------------------------------------------------------------------*/
/* �˺����� f_mount() �����б����ã�����Ϊ�������µ�ͬ���������ź����ͻ�������
/  ������0ʱ��f_mount() �������� FR_INT_ERR ��ʧ��
*/

// const osMutexDef_t Mutex[FF_VOLUMES];	/* CMSIS-RTOS �������� */

/**
 * @brief ����ͬ������
 * @param vol ��Ӧ�ľ����߼��������ţ�
 * @param sobj ָ�򷵻ش�����ͬ�������ָ��
 * @return 1:�����ɹ���0:�޷�����ͬ������
 */
int ff_cre_syncobj(                /* 1:�����ɹ���0:�޷�����ͬ������ */
                   BYTE vol,       /* ��Ӧ�ľ����߼��������ţ� */
                   FF_SYNC_t *sobj /* ָ�򷵻ش�����ͬ�������ָ�� */
)
{
    /* Windows API ʵ�� */
    *sobj = CreateMutex(NULL, FALSE, NULL);
    return (int)(*sobj != INVALID_HANDLE_VALUE);

    /* uITRON ʵʱ����ϵͳʵ�� */
//	T_CSEM csem = {TA_TPRI,1,1};
//	*sobj = acre_sem(&csem);
//	return (int)(*sobj > 0);

    /* uC/OS-II ʵʱ����ϵͳʵ�� */
//	OS_ERR err;
//	*sobj = OSMutexCreate(0, &err);
//	return (int)(err == OS_NO_ERR);

    /* FreeRTOS ʵʱ����ϵͳʵ�� */
//	*sobj = xSemaphoreCreateMutex();
//	return (int)(*sobj != NULL);

    /* CMSIS-RTOS ��׼�ӿ�ʵ�� */
//	*sobj = osMutexCreate(&Mutex[vol]);
//	return (int)(*sobj != NULL);
}
/*------------------------------------------------------------------------*/
/* ɾ��ͬ������                                                           */
/*------------------------------------------------------------------------*/
/* �˺����� f_mount() �����б����ã�����ɾ��ͨ�� ff_cre_syncobj() ����������ͬ������
/  ������0ʱ��f_mount() �������� FR_INT_ERR ��ʧ��
*/

/**
 * @brief ɾ��ͬ������
 * @param sobj Ҫɾ�����߼��������󶨵�ͬ������
 * @return 1:�����ɹ���0:������޷�ɾ��
 */
int ff_del_syncobj(               /* 1:�����ɹ���0:������޷�ɾ�� */
                   FF_SYNC_t sobj /* Ҫɾ�����߼��������󶨵�ͬ������ */
)
{
    /* Windows API ʵ�� */
    return (int)CloseHandle(sobj);

    /* uITRON ʵʱ����ϵͳʵ�� */
    //	return (int)(del_sem(sobj) == E_OK);

    /* uC/OS-II ʵʱ����ϵͳʵ�� */
    //	OS_ERR err;
    //	OSMutexDel(sobj, OS_DEL_ALWAYS, &err);
    //	return (int)(err == OS_NO_ERR);

    /* FreeRTOS ʵʱ����ϵͳʵ�� */
    //  vSemaphoreDelete(sobj);
    //	return 1;

    /* CMSIS-RTOS ��׼�ӿ�ʵ�� */
    //	return (int)(osMutexDelete(sobj) == osOK);
}

/*------------------------------------------------------------------------*/
/* ������ʾ���Ȩ��                                                       */
/*------------------------------------------------------------------------*/
/* �˺����ڽ����ļ�����ʱ�����ã�����������
/  ������0ʱ���ļ��������� FR_TIMEOUT ��ʧ��
*/

/**
 * @brief ������ʾ���Ȩ��
 * @param sobj Ҫ�ȴ���ͬ������
 * @return 1:����˷��ʾ���Ȩ�ޣ�0:�޷����Ȩ�ޣ���ʱ��
 */
int ff_req_grant(               /* 1:����˷��ʾ���Ȩ�ޣ�0:�޷����Ȩ�� */
                 FF_SYNC_t sobj /* Ҫ�ȴ���ͬ������ */
)
{
    /* Windows API ʵ�� */
    return (int)(WaitForSingleObject(sobj, FF_FS_TIMEOUT) == WAIT_OBJECT_0);

    /* uITRON ʵʱ����ϵͳʵ�� */
    //	return (int)(wai_sem(sobj) == E_OK);

    /* uC/OS-II ʵʱ����ϵͳʵ�� */
    //	OS_ERR err;
    //	OSMutexPend(sobj, FF_FS_TIMEOUT, &err));
    //	return (int)(err == OS_NO_ERR);

    /* FreeRTOS ʵʱ����ϵͳʵ�� */
    //	return (int)(xSemaphoreTake(sobj, FF_FS_TIMEOUT) == pdTRUE);

    /* CMSIS-RTOS ��׼�ӿ�ʵ�� */
    //	return (int)(osMutexWait(sobj, FF_FS_TIMEOUT) == osOK);
}

/*------------------------------------------------------------------------*/
/* �ͷŷ��ʾ���Ȩ��                                                       */
/*------------------------------------------------------------------------*/
/* �˺������뿪�ļ�����ʱ�����ã����ڽ�����
 */

/**
 * @brief �ͷŷ��ʾ���Ȩ��
 * @param sobj Ҫ�����źŵ�ͬ������
 */
void ff_rel_grant(
    FF_SYNC_t sobj /* Ҫ�����źŵ�ͬ������ */
)
{
    /* Windows API ʵ�� */
    ReleaseMutex(sobj);

    /* uITRON ʵʱ����ϵͳʵ�� */
    //	sig_sem(sobj);

    /* uC/OS-II ʵʱ����ϵͳʵ�� */
    //	OSMutexPost(sobj);

    /* FreeRTOS ʵʱ����ϵͳʵ�� */
    //	xSemaphoreGive(sobj);

    /* CMSIS-RTOS ��׼�ӿ�ʵ�� */
    //	osMutexRelease(sobj);
}

#endif
